driver-tests/pojose/wikiSamples/05_POJO2BPEL_CBR/caWWOrderRouter/src/jbiasa/caWWOrderRouter.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="caWWOrderRouter"
             xmlns:tns="caWWOrderRouter" xmlns:ns="http://cbr.pojo.openesb.glassfish.org/WWOrderRouter/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://cbr.pojo.openesb.glassfish.org/WWOrderRouter/" location="../jbiServiceUnits/jseWWOrderRouter/org/glassfish/openesb/pojo/cbr/WWOrderRouter.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:WWOrderRouterInterface">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="WWOrderRouterOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="caWWOrderRouter"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="caWWOrderRouter"/>
            </output>
        </operation>
    </binding>
    <service name="casaService1">
        <port name="pojoRouter" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/casaService1/pojoRouter"/>
        </port>
    </service>
</definitions>
