driver-tests/pojose/wikiSamples/05_POJO2BPEL_CBR/caWWOrderRouter/test/testPojoAsiaCenter/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
   xmlns:wwd="wwOrderProcessNS"
   xmlns:caw="caWWOrderRouter">
  <soapenv:Body>
    <caw:WWOrderRouterOperation>
      <part1>
          <wwd:order>
      <fulfillmentLocation>Asia</fulfillmentLocation>
      <orderPayload>Payload for Asia fulfillment center.</orderPayload>
    </wwd:order>
    </part1>
    </caw:WWOrderRouterOperation>
  </soapenv:Body>
</soapenv:Envelope>